src/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
//    (-30.0 -30.0 0)
//    (33.0 -30.0 0)
//   (33.0 33.0 0)
//    (-30.0 33.0 0)
//    (-30.0 -30.0 0.3)
//    (33.0 -30.0 0.3)
//    (33.0 33.0 0.3)
//    (-30.0 33.0 0.3)

//    (0.0 -30.0 0)
//    (33.0 -30.0 0)
//    (33.0 33.0 0)
//    (0.0 33.0 0)
//    (0.0 -30.0 0.3)
//    (33.0 -30.0 0.3)
//    (33.0 33.0 0.3)
//    (0.0 33.0 0.3)

    (0.0 -30.0 0)
    (31.5 -30.0 0)
    (31.5 33.0 0)
    (0.0 33.0 0)
    (0.0 -30.0 0.3)
    (31.5 -30.0 0.3)
    (31.5 33.0 0.3)
    (0.0 33.0 0.3)

);

blocks
(
   hex (0 1 2 3 4 5 6 7) (126 252 5) simpleGrading (1 1 1)
//   hex (0 1 2 3 4 5 6 7) (504 504 5) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (1 5 4 0)
    )
    patch outlet
    (
        (3 7 6 2)
    )
    wall walls
    (
        // (0 4 7 3)
        (2 6 5 1)
        (0 3 2 1)
        (4 5 6 7)
    )
    symmetryPlane symmetryPlane
    (
        (0 4 7 3)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
