src/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          630;
        startFace       589854;
    }
    outlet
    {
        type            patch;
        nFaces          630;
        startFace       590484;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          68748;
        startFace       591114;
    }
    symmetryPlane
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          2172;
        startFace       659862;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6144;
        startFace       662034;
    }
)

// ************************************************************************* //
