src/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.0e5;

boundaryField
{
    inlet
    {
        //~ type            fixedValue;
        //~ value           uniform 0;
        type            fixedFluxPressure;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    walls
    {
        type            fixedFluxPressure;
    }
    obstacle
    {
        type            fixedFluxPressure;
    }
    symmetryPlane
    {	
	type 		symmetryPlane;
    }

}


// ************************************************************************* //
